# loc and iloc for PANDAS In selection Data

### 1.loc — Label-based Indexing

loc tab use hota hai jab aap row ya column ka naam (label) use kar ke data select karna chahte hain.

Yani: Row/Column ka NAAM likhte hain

### 2. iloc — Position-based Indexing

iloc tab use hota hai jab aap row or column ki numeric position se data select karte hain.

Yani: Row numbers (0,1,2...) use hote hain

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv(r'C:\Users\dell\Desktop\exploratory-data-analysis-eda\Day 3 (DataFrames & Aggregating Data)\dataset\titanic.csv')

In [4]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [5]:
df.loc[0:5 , 'Sex':'SibSp']

      Sex   Age  SibSp
0    male  22.0      1
1  female  38.0      1
2  female  26.0      0
3  female  35.0      1
4    male  35.0      0
5    male   NaN      0

DIFF B/W ABOVE AND BELOW

In [6]:
df.loc[0:5 , ['Sex','SibSp']]

      Sex  SibSp
0    male      1
1  female      1
2  female      0
3  female      1
4    male      0
5    male      0

In [7]:
df.loc[:5 , 'Sex':'SibSp']

      Sex   Age  SibSp
0    male  22.0      1
1  female  38.0      1
2  female  26.0      0
3  female  35.0      1
4    male  35.0      0
5    male   NaN      0

In [8]:
df.loc[:5 , ['Sex','SibSp']]

      Sex  SibSp
0    male      1
1  female      1
2  female      0
3  female      1
4    male      0
5    male      0

In [9]:
df.loc[0:15 , 'Sex':'SibSp']

       Sex   Age  SibSp
0     male  22.0      1
1   female  38.0      1
2   female  26.0      0
3   female  35.0      1
4     male  35.0      0
5     male   NaN      0
6     male  54.0      0
7     male   2.0      3
8   female  27.0      0
9   female  14.0      1
10  female   4.0      1
11  female  58.0      0
12    male  20.0      0
13    male  39.0      1
14  female  14.0      0
15  female  55.0      0

In [10]:
# yahan error milay ga Q K loc fn main column name dyna hoga 
df.loc[0:15 , 5:8]

TypeError: cannot do slice indexing on Index with these indexers [5] of type int

. Above wala Error solve hoga iloc fn sy

. iloc k fn main last index not included

In [ ]:
# using iloc fun
df.iloc[0:15 , 5:8]

     Age  SibSp  Parch
0   22.0      1      0
1   38.0      1      0
2   26.0      0      0
3   35.0      1      0
4   35.0      0      0
5    NaN      0      0
6   54.0      0      0
7    2.0      3      1
8   27.0      0      2
9   14.0      1      0
10   4.0      1      1
11  58.0      0      0
12  20.0      0      0
13  39.0      1      5
14  14.0      0      0

In [ ]:
df.iloc[0:2 , 5:8]

    Age  SibSp  Parch
0  22.0      1      0
1  38.0      1      0

In [ ]:
# Fare : deck
# df.iloc[0:15 , 'Sex':'SibSp']  #ye iloc pr nahi chalta
# DIFF B/W 
df.iloc[0:15 , 5:7] #yahan chalta ha

     Age  SibSp
0   22.0      1
1   38.0      1
2   26.0      0
3   35.0      1
4   35.0      0
5    NaN      0
6   54.0      0
7    2.0      3
8   27.0      0
9   14.0      1
10   4.0      1
11  58.0      0
12  20.0      0
13  39.0      1
14  14.0      0

. loc main ending indexing bhi include hogi 

. iloc main ending indexing nahi include hogi

In [ ]:
# df.loc[InitialRowIndex : FinalRowIndex , InitialColumnName : FinalColumnName]
df.loc[1:4 , 'Survived':'Name']

   Survived  Pclass                                               Name
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina
3         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0       3                           Allen, Mr. William Henry

In [ ]:
df.loc[1:4 , ['Survived' , 'Name']]

   Survived                                               Name
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1                             Heikkinen, Miss. Laina
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4         0                           Allen, Mr. William Henry

In [ ]:
df.iloc[1:4 , 1:3]

   Survived  Pclass
1         1       1
2         1       3
3         1       1

In [ ]:
df.iloc[1:4 , [1,3]]

   Survived                                               Name
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1                             Heikkinen, Miss. Laina
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)

In [11]:
df.loc[0:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [12]:
df.loc[:2]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [14]:
df.loc[:3 , 'PassengerId':]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [ ]:
df.loc[2:3]#loc main complete indexing include hogi (starting to ending)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.100,C123,S

In [16]:
df.loc[2:3 , 'Name':]

,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.100,C123,S

In [17]:
df.loc[2:3 , :'Name']

   PassengerId  Survived  Pclass                                          Name
2            3         1       3                        Heikkinen, Miss. Laina
3            4         1       1  Futrelle, Mrs. Jacques Heath (Lily May Peel)

In [18]:
df.loc[2:3 , 'Name':'SibSp']

                                           Name     Sex   Age  SibSp
2                        Heikkinen, Miss. Laina  female  26.0      0
3  Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1

In [19]:
df.loc[2:3 , ['Name','SibSp']]

                                           Name  SibSp
2                        Heikkinen, Miss. Laina      0
3  Futrelle, Mrs. Jacques Heath (Lily May Peel)      1

In [25]:
df.loc[2:5, 'PassengerId':'Name']

   PassengerId  Survived  Pclass                                          Name
2            3         1       3                        Heikkinen, Miss. Laina
3            4         1       1  Futrelle, Mrs. Jacques Heath (Lily May Peel)
4            5         0       3                      Allen, Mr. William Henry
5            6         0       3                              Moran, Mr. James

In [34]:
df.iloc[0:10 , :1]

   PassengerId
0            1
1            2
2            3
3            4
4            5
5            6
6            7
7            8
8            9
9           10

In [33]:
df.iloc[:10 , 0:1]

   PassengerId
0            1
1            2
2            3
3            4
4            5
5            6
6            7
7            8
8            9
9           10

In [37]:
df.iloc[0:10 , 3:6]

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                           Allen, Mr. William Henry    male  35.0
5                                   Moran, Mr. James    male   NaN
6                            McCarthy, Mr. Timothy J    male  54.0
7                     Palsson, Master. Gosta Leonard    male   2.0
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0
9                Nasser, Mrs. Nicholas (Adele Achem)  female  14.0

In [38]:
df.iloc[0:10 , [3,6]]

                                                Name  SibSp
0                            Braund, Mr. Owen Harris      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...      1
2                             Heikkinen, Miss. Laina      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)      1
4                           Allen, Mr. William Henry      0
5                                   Moran, Mr. James      0
6                            McCarthy, Mr. Timothy J      0
7                     Palsson, Master. Gosta Leonard      3
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)      0
9                Nasser, Mrs. Nicholas (Adele Achem)      1

In [39]:
df.iloc[[2,6] , [3,4]]

                      Name     Sex
2   Heikkinen, Miss. Laina  female
6  McCarthy, Mr. Timothy J    male

In [40]:
df.iloc[[6] , [3]]

                      Name
6  McCarthy, Mr. Timothy J

In [41]:
df.iloc[[6] , [0]]

   PassengerId
6            7

In [42]:
df.iloc[[6] , [8]]

  Ticket
6  17463

In [45]:
df.loc[[6] , ['Ticket']]

  Ticket
6  17463

In [47]:
df.loc[[6] , 'Ticket':]

  Ticket     Fare Cabin Embarked
6  17463  51.8625   E46        S

In [48]:
df.loc[6:7 , 'Ticket']

6     17463
7    349909
Name: Ticket, dtype: object